In [9]:
import pandas as pd
import numpy as np

## Students Data

In [10]:
students_data = {"student_id" : [1, 2, 3, 4, 5, 6, 6],
                "name" : ['Ram', 'Sita', 'Hari', 'Gita', 'Suman', 
                          'Ravi', 'Ravi'],
                "age" : [21, 22, 20, 23, 24, 22, 22],
                "city" : ['Kathmandu', 'Pokhara', 'Kathmandu', 'Butwal', 
                          'Pokhara', 'Kathmandu', 'Kathmandu'],
                "marks_math" : [80, 92, 75, np.nan, 60, 85, 85],
                "marks_english" : [78, 88, np.nan, 70, 65, 90, 90]}

In [22]:
students_data['marks_math']

[80, 92, 75, nan, 60, 85, 85]

In [19]:
df_students = pd.DataFrame(students_data)

In [20]:
df_students

   student_id   name  age       city  marks_math  marks_english
0           1    Ram   21  Kathmandu        80.0           78.0
1           2   Sita   22    Pokhara        92.0           88.0
2           3   Hari   20  Kathmandu        75.0            NaN
3           4   Gita   23     Butwal         NaN           70.0
4           5  Suman   24    Pokhara        60.0           65.0
5           6   Ravi   22  Kathmandu        85.0           90.0
6           6   Ravi   22  Kathmandu        85.0           90.0

In [21]:
type(df_students)

pandas.core.frame.DataFrame

# Sales Data

In [17]:
sales_data = {
    "sales_id" : [101, 102, 103, 104, 105, 106, 107, 108],
    "product" : ["A", "A", "B", "B", "C", "A", "C", "B"],
    "region" : ["East", "West", "East", "West", "East", "East", "West", 
                "East"],
    "units_sold" : [10, 15, 7, 20, 5, 12, 8, 9],
    "price_per_unit" : [100, 100, 150, 150, 200, 100, 200, 150]
}

In [18]:
df_sales = pd.DataFrame(sales_data)
df_sales

   sales_id product region  units_sold  price_per_unit
0       101       A   East          10             100
1       102       A   West          15             100
2       103       B   East           7             150
3       104       B   West          20             150
4       105       C   East           5             200
5       106       A   East          12             100
6       107       C   West           8             200
7       108       B   East           9             150

## Series

In [23]:
math_series = df_students['marks_math']

In [24]:
type(math_series)

pandas.core.series.Series

In [25]:
math_series

0    80.0
1    92.0
2    75.0
3     NaN
4    60.0
5    85.0
6    85.0
Name: marks_math, dtype: float64

In [27]:
print("Values:", math_series.values)

Values: [80. 92. 75. nan 60. 85. 85.]

In [28]:
print("Index:", math_series.index)

Index: RangeIndex(start=0, stop=7, step=1)

## Create a series called `english_series` from `df_students` and print its values and index.

In [30]:
english_series = df_students['marks_english']
english_series

0    78.0
1    88.0
2     NaN
3    70.0
4    65.0
5    90.0
6    90.0
Name: marks_english, dtype: float64

In [31]:
english_series.values, english_series.index

(array([78., 88., nan, 70., 65., 90., 90.]),
 RangeIndex(start=0, stop=7, step=1))

## `shape`, `.info()`, `.describe()`

In [34]:
print("df_students overview:")
df_students

df_students overview:

   student_id   name  age       city  marks_math  marks_english
0           1    Ram   21  Kathmandu        80.0           78.0
1           2   Sita   22    Pokhara        92.0           88.0
2           3   Hari   20  Kathmandu        75.0            NaN
3           4   Gita   23     Butwal         NaN           70.0
4           5  Suman   24    Pokhara        60.0           65.0
5           6   Ravi   22  Kathmandu        85.0           90.0
6           6   Ravi   22  Kathmandu        85.0           90.0

In [35]:
print("Shape(rows, columns):", df_students.shape)

Shape(rows, columns): (7, 6)

In [36]:
print("Info:")
print(df_students.info())

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   student_id     7 non-null      int64
 1   name           7 non-null      object
 2   age            7 non-null      int64
 3   city           7 non-null      object
 4   marks_math     6 non-null      float64
 5   marks_english  6 non-null      float64
dtypes: float64(2), int64(2), object(2)
memory usage: 468.0+ bytes
None

In [38]:
print("Summary Statistics:")
df_students.describe()

Summary Statistics:

       student_id        age  marks_math  marks_english
count    7.000000   7.000000    6.000000       6.000000
mean     3.857143  22.000000   79.500000      80.166667
std      1.951800   1.290994   11.113055      10.888832
min      1.000000  20.000000   60.000000      65.000000
25%      2.500000  21.500000   76.250000      72.000000
50%      4.000000  22.000000   82.500000      83.000000
75%      5.500000  22.500000   85.000000      89.500000
max      6.000000  24.000000   92.000000      90.000000

In [39]:
df_students

   student_id   name  age       city  marks_math  marks_english
0           1    Ram   21  Kathmandu        80.0           78.0
1           2   Sita   22    Pokhara        92.0           88.0
2           3   Hari   20  Kathmandu        75.0            NaN
3           4   Gita   23     Butwal         NaN           70.0
4           5  Suman   24    Pokhara        60.0           65.0
5           6   Ravi   22  Kathmandu        85.0           90.0
6           6   Ravi   22  Kathmandu        85.0           90.0

In [41]:
df_students.head(2)

   student_id  name  age       city  marks_math  marks_english
0           1   Ram   21  Kathmandu        80.0           78.0
1           2  Sita   22    Pokhara        92.0           88.0

In [43]:
df_students.tail(2)

   student_id  name  age       city  marks_math  marks_english
5           6  Ravi   22  Kathmandu        85.0           90.0
6           6  Ravi   22  Kathmandu        85.0           90.0

In [45]:
df_students.columns

Index(['student_id', 'name', 'age', 'city', 'marks_math', 'marks_english'], dtype='object')

## `.unique()`, `.nunique()`, `value_counts()`

In [47]:
df_students['city'].unique()

array(['Kathmandu', 'Pokhara', 'Butwal'], dtype=object)

In [48]:
df_students['city'].nunique()

3

In [49]:
df_students['city'].value_counts()

city
Kathmandu    4
Pokhara      2
Butwal       1
Name: count, dtype: int64

## Missing Values - `.isna()`

In [53]:
df_students.isna().sum()

student_id       0
name             0
age              0
city             0
marks_math       1
marks_english    1
dtype: int64

## Filling and Dropping Missing Values - `.fillna()`, `.dropna()`

In [56]:
df_students_dropna = df_students.dropna()

In [58]:
df_students_dropna

   student_id   name  age       city  marks_math  marks_english
0           1    Ram   21  Kathmandu        80.0           78.0
1           2   Sita   22    Pokhara        92.0           88.0
4           5  Suman   24    Pokhara        60.0           65.0
5           6   Ravi   22  Kathmandu        85.0           90.0
6           6   Ravi   22  Kathmandu        85.0           90.0

In [59]:
# calculating the mean
math_mean  = df_students['marks_math'].mean()
math_mean

79.5

In [60]:
df_students_filled = df_students.copy()
df_students_filled['marks_math'] = df_students_filled['marks_math'].fillna(math_mean)

In [61]:
df_students_filled

   student_id   name  age       city  marks_math  marks_english
0           1    Ram   21  Kathmandu        80.0           78.0
1           2   Sita   22    Pokhara        92.0           88.0
2           3   Hari   20  Kathmandu        75.0            NaN
3           4   Gita   23     Butwal        79.5           70.0
4           5  Suman   24    Pokhara        60.0           65.0
5           6   Ravi   22  Kathmandu        85.0           90.0
6           6   Ravi   22  Kathmandu        85.0           90.0

In [62]:
# calculating the mean
english_mean  = df_students['marks_english'].mean()
english_mean

80.16666666666667

In [63]:
df_students_filled['marks_english'] = df_students_filled['marks_english'].fillna(english_mean)

In [64]:
df_students_filled

   student_id   name  age       city  marks_math  marks_english
0           1    Ram   21  Kathmandu        80.0      78.000000
1           2   Sita   22    Pokhara        92.0      88.000000
2           3   Hari   20  Kathmandu        75.0      80.166667
3           4   Gita   23     Butwal        79.5      70.000000
4           5  Suman   24    Pokhara        60.0      65.000000
5           6   Ravi   22  Kathmandu        85.0      90.000000
6           6   Ravi   22  Kathmandu        85.0      90.000000

In [65]:
df_students

   student_id   name  age       city  marks_math  marks_english
0           1    Ram   21  Kathmandu        80.0           78.0
1           2   Sita   22    Pokhara        92.0           88.0
2           3   Hari   20  Kathmandu        75.0            NaN
3           4   Gita   23     Butwal         NaN           70.0
4           5  Suman   24    Pokhara        60.0           65.0
5           6   Ravi   22  Kathmandu        85.0           90.0
6           6   Ravi   22  Kathmandu        85.0           90.0

In [67]:
df_students.duplicated().sum()

1

In [70]:
df_students = df_students.drop_duplicates()

In [71]:
df_students

   student_id   name  age       city  marks_math  marks_english
0           1    Ram   21  Kathmandu        80.0           78.0
1           2   Sita   22    Pokhara        92.0           88.0
2           3   Hari   20  Kathmandu        75.0            NaN
3           4   Gita   23     Butwal         NaN           70.0
4           5  Suman   24    Pokhara        60.0           65.0
5           6   Ravi   22  Kathmandu        85.0           90.0

## Filtering Operation

In [78]:
df_students['age'] >= 23

0    False
1    False
2    False
3     True
4     True
5    False
Name: age, dtype: bool

In [76]:
age_filter = df_students['age'] >= 23
df_students[age_filter]

   student_id   name  age     city  marks_math  marks_english
3           4   Gita   23   Butwal         NaN           70.0
4           5  Suman   24  Pokhara        60.0           65.0

In [79]:
df_students.columns

Index(['student_id', 'name', 'age', 'city', 'marks_math', 'marks_english'], dtype='object')

## Find all the students who are younger than 23 and have math marks above 75.

In [80]:
age_filter = df_students['age'] <=23
math_filter = df_students['marks_math'] > 75

df_students[age_filter & math_filter]

   student_id  name  age       city  marks_math  marks_english
0           1   Ram   21  Kathmandu        80.0           78.0
1           2  Sita   22    Pokhara        92.0           88.0
5           6  Ravi   22  Kathmandu        85.0           90.0

## Find all the students from Pokhara with english marks > 80.

In [81]:
city_filter = df_students['city'] == 'Pokhara'
english_filter = df_students['marks_english'] > 80

df_students[city_filter & english_filter]

   student_id  name  age     city  marks_math  marks_english
1           2  Sita   22  Pokhara        92.0           88.0

## Find all the students from Kathmandu.

In [83]:
df_students[df_students['city'] == 'Kathmandu']

   student_id  name  age       city  marks_math  marks_english
0           1   Ram   21  Kathmandu        80.0           78.0
2           3  Hari   20  Kathmandu        75.0            NaN
5           6  Ravi   22  Kathmandu        85.0           90.0

## Creating New Columns

In [86]:
df_students = df_students_filled

In [87]:
df_students

   student_id   name  age       city  marks_math  marks_english
0           1    Ram   21  Kathmandu        80.0      78.000000
1           2   Sita   22    Pokhara        92.0      88.000000
2           3   Hari   20  Kathmandu        75.0      80.166667
3           4   Gita   23     Butwal        79.5      70.000000
4           5  Suman   24    Pokhara        60.0      65.000000
5           6   Ravi   22  Kathmandu        85.0      90.000000
6           6   Ravi   22  Kathmandu        85.0      90.000000

In [89]:
df_students['total_marks'] = df_students['marks_math'] + df_students['marks_english']

In [90]:
df_students

   student_id   name  age       city  marks_math  marks_english  total_marks
0           1    Ram   21  Kathmandu        80.0      78.000000   158.000000
1           2   Sita   22    Pokhara        92.0      88.000000   180.000000
2           3   Hari   20  Kathmandu        75.0      80.166667   155.166667
3           4   Gita   23     Butwal        79.5      70.000000   149.500000
4           5  Suman   24    Pokhara        60.0      65.000000   125.000000
5           6   Ravi   22  Kathmandu        85.0      90.000000   175.000000
6           6   Ravi   22  Kathmandu        85.0      90.000000   175.000000

In [91]:
df_students['Percentage'] = df_students['total_marks']/2
df_students

,student_id,name,age,city,marks_math,marks_english,total_marks,Percentage
0,1,Ram,21,Kathmandu,80.0,78.000000,158.000000,79.000000
1,2,Sita,22,Pokhara,92.0,88.000000,180.000000,90.000000
2,3,Hari,20,Kathmandu,75.0,80.166667,155.166667,77.583333
3,4,Gita,23,Butwal,79.5,70.000000,149.500000,74.750000
4,5,Suman,24,Pokhara,60.0,65.000000,125.000000,62.500000
5,6,Ravi,22,Kathmandu,85.0,90.000000,175.000000,87.500000
6,6,Ravi,22,Kathmandu,85.0,90.000000,175.000000,87.500000

## Create a column `Passed Math` (marks > 70)

In [92]:
df_students['Passed_Math'] = df_students['marks_math'] > 70
df_students

,student_id,name,age,city,marks_math,marks_english,total_marks,Percentage,Passed_Math
0,1,Ram,21,Kathmandu,80.0,78.000000,158.000000,79.000000,True
1,2,Sita,22,Pokhara,92.0,88.000000,180.000000,90.000000,True
2,3,Hari,20,Kathmandu,75.0,80.166667,155.166667,77.583333,True
3,4,Gita,23,Butwal,79.5,70.000000,149.500000,74.750000,True
4,5,Suman,24,Pokhara,60.0,65.000000,125.000000,62.500000,False
5,6,Ravi,22,Kathmandu,85.0,90.000000,175.000000,87.500000,True
6,6,Ravi,22,Kathmandu,85.0,90.000000,175.000000,87.500000,True

## Sorting Values, `.sort_values()`

In [93]:
df_students

,student_id,name,age,city,marks_math,marks_english,total_marks,Percentage,Passed_Math
0,1,Ram,21,Kathmandu,80.0,78.000000,158.000000,79.000000,True
1,2,Sita,22,Pokhara,92.0,88.000000,180.000000,90.000000,True
2,3,Hari,20,Kathmandu,75.0,80.166667,155.166667,77.583333,True
3,4,Gita,23,Butwal,79.5,70.000000,149.500000,74.750000,True
4,5,Suman,24,Pokhara,60.0,65.000000,125.000000,62.500000,False
5,6,Ravi,22,Kathmandu,85.0,90.000000,175.000000,87.500000,True
6,6,Ravi,22,Kathmandu,85.0,90.000000,175.000000,87.500000,True

In [94]:
df_students.sort_values(by="total_marks", ascending=False)

,student_id,name,age,city,marks_math,marks_english,total_marks,Percentage,Passed_Math
1,2,Sita,22,Pokhara,92.0,88.000000,180.000000,90.000000,True
5,6,Ravi,22,Kathmandu,85.0,90.000000,175.000000,87.500000,True
6,6,Ravi,22,Kathmandu,85.0,90.000000,175.000000,87.500000,True
0,1,Ram,21,Kathmandu,80.0,78.000000,158.000000,79.000000,True
2,3,Hari,20,Kathmandu,75.0,80.166667,155.166667,77.583333,True
3,4,Gita,23,Butwal,79.5,70.000000,149.500000,74.750000,True
4,5,Suman,24,Pokhara,60.0,65.000000,125.000000,62.500000,False

In [97]:
sorted_by_city_and_total = df_students.sort_values(by = ["city", "total_marks"],
                                                  ascending = [True, False])
sorted_by_city_and_total

,student_id,name,age,city,marks_math,marks_english,total_marks,Percentage,Passed_Math
3,4,Gita,23,Butwal,79.5,70.000000,149.500000,74.750000,True
5,6,Ravi,22,Kathmandu,85.0,90.000000,175.000000,87.500000,True
6,6,Ravi,22,Kathmandu,85.0,90.000000,175.000000,87.500000,True
0,1,Ram,21,Kathmandu,80.0,78.000000,158.000000,79.000000,True
2,3,Hari,20,Kathmandu,75.0,80.166667,155.166667,77.583333,True
1,2,Sita,22,Pokhara,92.0,88.000000,180.000000,90.000000,True
4,5,Suman,24,Pokhara,60.0,65.000000,125.000000,62.500000,False

### Grouping and Aggregating

In [98]:
df_sales

   sales_id product region  units_sold  price_per_unit
0       101       A   East          10             100
1       102       A   West          15             100
2       103       B   East           7             150
3       104       B   West          20             150
4       105       C   East           5             200
5       106       A   East          12             100
6       107       C   West           8             200
7       108       B   East           9             150

In [99]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sales_id        8 non-null      int64
 1   product         8 non-null      object
 2   region          8 non-null      object
 3   units_sold      8 non-null      int64
 4   price_per_unit  8 non-null      int64
dtypes: int64(3), object(2)
memory usage: 452.0+ bytes

In [100]:
df_sales.describe()

        sales_id  units_sold  price_per_unit
count    8.00000    8.000000        8.000000
mean   104.50000   10.750000      143.750000
std      2.44949    4.832923       41.726148
min    101.00000    5.000000      100.000000
25%    102.75000    7.750000      100.000000
50%    104.50000    9.500000      150.000000
75%    106.25000   12.750000      162.500000
max    108.00000   20.000000      200.000000

In [101]:
df_sales.columns

Index(['sales_id', 'product', 'region', 'units_sold', 'price_per_unit'], dtype='object')

In [102]:
df_sales

   sales_id product region  units_sold  price_per_unit
0       101       A   East          10             100
1       102       A   West          15             100
2       103       B   East           7             150
3       104       B   West          20             150
4       105       C   East           5             200
5       106       A   East          12             100
6       107       C   West           8             200
7       108       B   East           9             150

In [103]:
df_sales['revenue'] = df_sales['units_sold'] * df_sales['price_per_unit']

In [104]:
df_sales

   sales_id product region  units_sold  price_per_unit  revenue
0       101       A   East          10             100     1000
1       102       A   West          15             100     1500
2       103       B   East           7             150     1050
3       104       B   West          20             150     3000
4       105       C   East           5             200     1000
5       106       A   East          12             100     1200
6       107       C   West           8             200     1600
7       108       B   East           9             150     1350

## How many units have been sold for each Product?

### `.groupby()`

In [106]:
df_sales.groupby('product').groups

{'A': [0, 1, 5], 'B': [2, 3, 7], 'C': [4, 6]}

In [108]:
df_sales.groupby('product').get_group("B")

   sales_id product region  units_sold  price_per_unit  revenue
2       103       B   East           7             150     1050
3       104       B   West          20             150     3000
7       108       B   East           9             150     1350

In [109]:
df_sales.groupby('product')['units_sold'].sum()

product
A    37
B    36
C    13
Name: units_sold, dtype: int64

## Find the total revenue based on Product.

In [111]:
df_sales.groupby('product')['revenue'].sum()

product
A    3700
B    5400
C    2600
Name: revenue, dtype: int64

In [114]:
## Which product brings the highest total revenue? Which product sells the most units?
## - B, A

## Find the total revenue based on region.

In [115]:
df_sales.groupby('region')['revenue'].sum()

region
East    5600
West    6100
Name: revenue, dtype: int64

## Average units sold by region

In [116]:
df_sales.columns

Index(['sales_id', 'product', 'region', 'units_sold', 'price_per_unit',
       'revenue'],
      dtype='object')

In [117]:
df_sales.groupby('region')['units_sold'].mean()

region
East     8.600000
West    14.333333
Name: units_sold, dtype: float64

## Find the number of sales recorded per region.

In [118]:
df_sales.groupby('region').size()

region
East    5
West    3
dtype: int64